"""
Задание 1.

Каждое из слов «разработка», «сокет», «декоратор» представить
в буквенном формате и проверить тип и содержание соответствующих переменных.
Затем с помощью онлайн-конвертера преобразовать
в набор кодовых точек Unicode (НО НЕ В БАЙТЫ!!!)
и также проверить тип и содержимое переменных.

*Попытайтесь получить кодовые точки без онлайн-конвертера!
без хардкода!

Подсказки:
--- 'разработка' - буквенный формат
--- '\u0440\u0430\u0437\u0440\u0430\u0431\u043e\u0442\u043a\u0430' - набор кодовых точек
--- используйте списки и циклы, не дублируйте функции
"""

words_list = ["разработка", "сокет", "декоратор"]
unicode_words_list = []

for word in words_list:
    unicode_word = ""
    for char in word:
        unicode_word += '\\u%04x' % ord(char)
    unicode_words_list.append(unicode_word)
    print(type(word))
    print(word)

for word in unicode_words_list:
    print(type(word))
    print(word)
